Контроль_сервера_1С/src/DataProcessors/КонсольЗаданий/КонсольЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КонсольЗаданий</name>
  <tabularSections>
    <name>ТЗРегламентныеЗадания</name>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Предопределенное</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Метаданные</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПользователя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоследнееЗадание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Расписание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнтервалПовтораПриАварийномЗавершении</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПовторовПриАварийномЗавершении</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Параметры</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РазделениеДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Контроль_сервера_1С/src/DataProcessors/КонсольЗаданий/Forms/ФормаРегламентногоЗадания/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Если УникальныйИдентификатор существует, то редактируем текущее задание, 
	// В противном случае - создаем новое
	Если Параметры.Свойство("УникальныйИдентификатор") Тогда
		
		Элементы.ТипЗадания.Доступность = Ложь;
		
		Идентификатор 								= Новый УникальныйИдентификатор(Параметры.УникальныйИдентификатор);
		Задание 									= РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Идентификатор);
		
		Наименование								= Задание.Наименование;
		ИнтервалПовтораПриАварийномЗавершении		= Задание.ИнтервалПовтораПриАварийномЗавершении;
		КоличествоПовторовПриАварийномЗавершении	= Задание.КоличествоПовторовПриАварийномЗавершении;
		Использование								= Задание.Использование;
		Предопределенное							= Задание.Предопределенное;
		Расписание									= Задание.Расписание;
		МетаданныеЗадание							= Задание.Метаданные.Имя;
		ТипЗадания									= Задание.Метаданные;
		УникальныйИдентификаторЗадания				= Параметры.УникальныйИдентификатор;
		
	Иначе	
		
		Расписание = Новый РасписаниеРегламентногоЗадания;	
		
		Для Каждого Элемент ИЗ Метаданные.РегламентныеЗадания Цикл			
			Элементы.ТипЗадания.СписокВыбора.Добавить(Элемент.Имя,Элемент.Синоним);		
		КонецЦикла;		
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура ТипЗаданияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	МетаданныеЗадание=ВыбранноеЗначение;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ЗаписатьРегламентноеЗадание()
	
	Если не ПустаяСтрока(УникальныйИдентификаторЗадания) Тогда		
		Идентификатор = Новый УникальныйИдентификатор(УникальныйИдентификаторЗадания);
		Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Идентификатор);		
	Иначе		
		Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(МетаданныеЗадание);		
	КонецЕсли;
	
	Задание.Наименование								= Наименование;
	Задание.ИнтервалПовтораПриАварийномЗавершении		= ИнтервалПовтораПриАварийномЗавершении;
	Задание.КоличествоПовторовПриАварийномЗавершении	= КоличествоПовторовПриАварийномЗавершении;
	Задание.Использование								= Использование;
	Задание.Расписание									= Расписание;
	
	Задание.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписание(Команда)
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	Диалог.Показать(Новый ОписаниеОповещения("ОбновитьРасписание", ЭтотОбъект));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если Не ЗначениеЗаполнено(ТипЗадания) Или Не ЗначениеЗаполнено(Наименование) Тогда		
		Сообщить("Не заполнены обязательные реквизиты");
		Возврат;		
	КонецЕсли;
	
	ЗаписатьРегламентноеЗадание();	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРасписание(НовоеРасписание, Неопределен) Экспорт
	
	Если НовоеРасписание <> Неопределено Тогда		
		Расписание = НовоеРасписание;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
